In [2]:
import pandas as pd

In [3]:
df = pd.DataFrame({'Date':['10/2/2011', '11/2/2011', '12/2/2011', '13/2/2011'],
                    'Event':['Music', 'Poetry', 'Theatre', 'Comedy'],
                    'Cost':[10000, 5000, 15000, 2000]})
df

        Date    Event   Cost
0  10/2/2011    Music  10000
1  11/2/2011   Poetry   5000
2  12/2/2011  Theatre  15000
3  13/2/2011   Comedy   2000

#### Now we will create a new column called ‘Discounted_Price’ after applying a 10% discount on the existing ‘Cost’ column.

## map()

In [6]:
df['Discounted_Price']=df['Cost'].map(lambda x:x-x*0.1)

In [7]:
df

        Date    Event   Cost  Discounted_Price
0  10/2/2011    Music  10000            9000.0
1  11/2/2011   Poetry   5000            4500.0
2  12/2/2011  Theatre  15000           13500.0
3  13/2/2011   Comedy   2000            1800.0

## apply()

In [8]:
df = pd.DataFrame({'Date':['10/2/2011', '11/2/2011', '12/2/2011', '13/2/2011'],
                    'Event':['Music', 'Poetry', 'Theatre', 'Comedy'],
                    'Cost':[10000, 5000, 15000, 2000]})
df

        Date    Event   Cost
0  10/2/2011    Music  10000
1  11/2/2011   Poetry   5000
2  12/2/2011  Theatre  15000
3  13/2/2011   Comedy   2000

In [13]:
df['Discounted_Price']=df.apply(lambda x:x['Cost']-x['Cost']*0.1,axis=1)

In [14]:
df

        Date    Event   Cost  Discounted_Price
0  10/2/2011    Music  10000            9000.0
1  11/2/2011   Poetry   5000            4500.0
2  12/2/2011  Theatre  15000           13500.0
3  13/2/2011   Comedy   2000            1800.0

### We can achieve the same result by directly performing the required operation on the desired column element-wise.

In [17]:
df['Discounted_Price']=df['Cost']+df['Cost']*0.1

In [18]:
df

        Date    Event   Cost  Discounted_Price
0  10/2/2011    Music  10000           11000.0
1  11/2/2011   Poetry   5000            5500.0
2  12/2/2011  Theatre  15000           16500.0
3  13/2/2011   Comedy   2000            2200.0